{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "repeat",
    "2": "goodbye",
    "3": "creator",
    "4": "name",
    "5": "hours",
    "6": "number",
    "7": "products",
    "8": "pizza",
    "9": "location",
    "10": "chicken",
    "11": "noodle",
    "12": "drink",
    "13": "other",
    "14": "random",
    "15": "swear",
    "16": "salutaion",
    "17": "task",
    "18": "hod"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "chicken": 10,
    "creator": 3,
    "drink": 12,
    "goodbye": 2,
    "greeting": 0,
    "hod": 18,
    "hours": 5,
    "location": 9,
    "name": 4,
    "noodle": 11,
    "number": 6,
    "other": 13,
    "pizza": 8,
    "products": 7,
    "random": 14,
    "repeat": 1,
    "salutaion": 16,
    "swear": 15,
    "task": 17
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
