{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "repeat",
    "2": "goodbye",
    "3": "creator",
    "4": "name",
    "5": "hours",
    "6": "number",
    "7": "course",
    "8": "fees",
    "9": "location",
    "10": "hostel",
    "11": "event",
    "12": "document",
    "13": "floors",
    "14": "syllabus",
    "15": "library",
    "16": "infrastructure",
    "17": "canteen",
    "18": "menu",
    "19": "placement",
    "20": "ithod",
    "21": "computerhod",
    "22": "extchod",
    "23": "principal",
    "24": "sem",
    "25": "admission",
    "26": "scholarship",
    "27": "facilities",
    "28": "college intake",
    "29": "uniform",
    "30": "committee",
    "31": "random",
    "32": "swear",
    "33": "vacation",
    "34": "sports",
    "35": "salutaion",
    "36": "task",
    "37": "ragging",
    "38": "hod"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "admission": 25,
    "canteen": 17,
    "college intake": 28,
    "committee": 30,
    "computerhod": 21,
    "course": 7,
    "creator": 3,
    "document": 12,
    "event": 11,
    "extchod": 22,
    "facilities": 27,
    "fees": 8,
    "floors": 13,
    "goodbye": 2,
    "greeting": 0,
    "hod": 38,
    "hostel": 10,
    "hours": 5,
    "infrastructure": 16,
    "ithod": 20,
    "library": 15,
    "location": 9,
    "menu": 18,
    "name": 4,
    "number": 6,
    "placement": 19,
    "principal": 23,
    "ragging": 37,
    "random": 31,
    "repeat": 1,
    "salutaion": 35,
    "scholarship": 26,
    "sem": 24,
    "sports": 34,
    "swear": 32,
    "syllabus": 14,
    "task": 36,
    "uniform": 29,
    "vacation": 33
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
